import 'package:final_project/models/material.dart';

const List<UserMaterial> materials = [
  UserMaterial(
    id: 1,
    title: 'Бюджетування і кредитна історія',
    description:
        'Що являє собою бюджетування і як правильно планувати свої фінанси. Що таке кредитна історія та як вона впливає на вашу можливість отримати кредит.',
    imagePath: 'assets/images/education_images/lesson_1_pic.png',
    tests: [
      [
        'Що таке бюджет?',
        'План витрат та доходів на певний період часу',
        'Листівка з вітаннями',
        'Інструмент для вимірювання ваги',
        'Інструмент для вимірювання часу',
      ],
      [
        'Що таке бюджет?',
        'План витрат та доходів на певний період часу',
        'Листівка з вітаннями',
        'Інструмент для вимірювання ваги',
        'Інструмент для вимірювання часу',
      ],
      [
        'Що таке бюджет?',
        'План витрат та доходів на певний період часу',
        'Листівка з вітаннями',
        'Інструмент для вимірювання ваги',
        'Інструмент для вимірювання часу',
      ],
    ],
  ),
  UserMaterial(
    id: 2,
    title: 'Податкова система та фінансові права споживачів',
    description:
        'Правильне розуміння своїх як податкових зобов\'язань, так і прав споживачів фінансових послуг, як захистити свої права споживача.',
    imagePath: 'assets/images/education_images/lesson_2_pic.png',
    tests: [
      [
        'Що таке податкова система?',
        'Сукупність законів та правил, які встановлюють систему оподаткування',
        'Лікарський препарат для лікування захворювань шлунку',
        'Метод розрахунку грошової вартості товарів та послуг',
        'Сукупність нормативних актів щодо прав споживачів',
      ],
    ],
  ),
];
